# IsValid Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarConstraint..::..IsValid Method
RebarConstraint Class See Also
---
Checks that the RebarConstraint still has access to valid Rebar constraint data and that its RebarConstraintsManager is still valid.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool IsValid()
```

Visual Basic
---
```text
Public Function IsValid As Boolean
```

Visual C++
---
```text
public:
bool IsValid()
```

# See Also
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace